import { Grid, Typography } from '@material-ui/core'
import Image from '../Elements/image'
import React from 'react'
import Typographyp from '../Elements/Typographyp'
import Imagearticledetail from '../Partials/Imagearticledetail'
import TextField from '@material-ui/core/TextField';
import SearchIcon from '@material-ui/icons/Search';
import Basictitle from '../Elements/Basictitle';
import Articlebox from '../Partials/Articlebox'
import Header from './Header'
import Footer from './Footer'
export default function Articledetail() {
    return (
        <Grid >
            <Header/>
        <Grid container spacing={2} style={{margin:'10px'}}>
            <Grid item md={9} xs={12}>
            <Grid>
             <Imagearticledetail /></Grid>
             <Grid>
                 <Typographyp textcolor="#081741" size="23px" text="لورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است"/>
             </Grid>
             <Grid>
                <Image width="95%" height="350" src="/static/pic8.jpg" alt="ax" border="solid 1px"/>
             </Grid>
             <Grid>
                  <Typographyp textcolor="#081741" size="23px" text="لورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است"/>
             </Grid>
        </Grid>
        <Grid item md={3}>
            <Grid style={{marginBottom:'30px' ,marginTop:'30px'}}>
            <Typography style={{fontSize:'30px', color:'#081741'}}>نوشته شده توسط</Typography>  
            <Typography style={{fontSize:'20px', color:'#081741'}}>علی محمدی</Typography>  
            <Typography style={{fontSize:'20px', color:'#081741'}}>فاطمه رضایی</Typography>  
            </Grid>
            <Grid style={{marginBottom:'30px' ,marginTop:'30px'}}>
            <Typography style={{fontSize:'30px', color:'#081741'}}>پست های اخیر</Typography>  
            <Typography style={{fontSize:'20px', color:'#081741'}}>مهندسی</Typography>  
            <Typography style={{fontSize:'20px', color:'#081741'}}>شیرینی</Typography>  
            <Typography style={{fontSize:'20px', color:'#081741'}}>غذا</Typography>  
            </Grid>
            <Grid style={{marginBottom:'30px' ,marginTop:'30px'}}>
            <form  noValidate autoComplete="off">
                <label >
               <Typography style={{fontSize:'30px', color:'#081741'}}>جست و جو</Typography>      
                </label>
                
                 <TextField id="outlined-basic" label={<SearchIcon/>}  variant="outlined" />
                 
             
           </form>
            </Grid>
            <Grid style={{marginBottom:'30px' ,marginTop:'70px'}}>
               <Image width="95%" height="550" src="/static/pic16.jpg" alt="ax" />
            </Grid>
            <Grid style={{marginBottom:'30px' ,marginTop:'30px'}}>
                <Image width="95%" height="550" src="/static/pic6.jpg" alt="ax" />
            </Grid>
        </Grid>
        </Grid>

        <Grid style={{marginBottom:'40px',direction:'rtl',marginTop:'40px'}} item xs={12}>
             <Basictitle margin="30px" color="black" title="مقالات مشابه" fontsize="30px" href="#" />
           </Grid>
           <Grid container spacing={3}>
     
            <Grid item md={3} xs={12}>
              <Articlebox articlesrc="/static/pic1.jpg"  titlearticle="لورم اسپورم" textarticle="لورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است" />
            </Grid>
            <Grid item md={3} xs={12}>
              <Articlebox articlesrc="/static/pic2.jpg"  titlearticle="لورم اسپورم" textarticle="لورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است"/>
            </Grid>
            <Grid item md={3} xs={12} >
              <Articlebox articlesrc="/static/pic3.jpg"  titlearticle="لورم اسپورم" textarticle="لورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است"/>
            </Grid>
            <Grid item md={3} xs={12} >
              <Articlebox articlesrc="/static/pic4.jpg"  titlearticle="لورم اسپورم" textarticle="لورم اسپورم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است"/>
            </Grid>
            
            </Grid>
            <Footer/>
        </Grid>
    )
}
